import db from '../../models';

// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
const getAllSpecialties = async (page = 1) => {
	try {
		const offset = (page - 1) * 20;
		const { count, rows } = await db.Specialty.findAndCountAll({
			attributes: ['specialty_id', 'name', 'description', 'image', 'createdAt'],
			order: [['createdAt', 'DESC']],
			limit: 20,
			offset,
			raw: true, nest: true
		});
		return {
			EC: 0,
			EM: 'Lấy danh sách chuyên môn thành công',
			DT: { 
				specialties: rows, 
				total: count, 
				totalPages: Math.ceil(count / 20) 
			}
		};
	} catch (error) {
		console.error('Lỗi getAllSpecialtiess:', error);
		return {
			EC: -1,
			EM: 'Lỗi khi lấy danh sách chuyên môn',
			DT: [],
			total: 0
		};
	}
};
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
const createSpecialty = async (data, imagePath) => {
	try {
		const { name, description } = data;

		if (!name || !description) {
			return { EC: -1, EM: 'Thiếu tên hoặc mô tả chuyên môn.' };
		}

		const existing = await db.Specialty.findOne({ where: { name } });
		if (existing) {
			return { EC: -1, EM: 'Tên chuyên môn đã tồn tại.' };
		}

		await db.Specialty.create({
			name,
			description,
			image: imagePath
		});

		return { EC: 0, EM: 'Tạo chuyên môn thành công.' };
	} catch (error) {
		console.error('Error creating specialty:', error);
		return { EC: -1, EM: 'Lỗi server khi tạo chuyên môn.' };
	}
};

// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
export default {
	getAllSpecialties,
	createSpecialty
};
