import db from '../../models';
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
const getAllStore = async (page = 1) => {
	try {
		const offset = (page - 1) * 20;
		const { count, rows } = await db.Store.findAndCountAll({
			attributes: ['store_id', 'name', 'address', 'phone', 'createdAt'],
			order: [['createdAt', 'DESC']],
			limit: 20,
			offset,
			raw: true
		});
		return {
			EC: 0,
			EM: 'Lấy danh sách cửa hàng thành công',
			DT: {
				stores: rows,
				total: count,
				totalPages: Math.ceil(count / 20)
			}
		};
	} catch (error) {
		console.error('Lỗi getAllStore:', error);
		return {
			EC: -1,
			EM: 'Lỗi khi lấy danh sách cửa hàng',
			DT: []
		};
	}
};
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
const getStoreById = async (store_id) => {
	try {
		const store = await db.Store.findOne({
			where: { store_id },
			attributes: ['store_id', 'name', 'address', 'phone', 'store_image', 'createdAt'],
			raw: true, nest: true
		});
		if (!store) {
			return { EC: -1, EM: 'Không tìm thấy cửa hàng.', DT: null };
		}
		return {
			EC: 0,
			EM: 'Lấy chi tiết cửa hàng thành công.',
			DT: store
		};
	} catch (error) {
		console.error('Lỗi getStoreById:', error);
		return {
			EC: -1,
			EM: 'Lỗi khi lấy thông tin cửa hàng.',
			DT: null
		};
	}
};
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
const createStore = async (data, imagePath) => {
    try {
        const { name, address, phone } = data;

        if (!name || !address || !phone) {
            return { EC: -1, EM: 'Thiếu thông tin cửa hàng.' };
        }

        const existing = await db.Store.findOne({ where: { name: name } });
        if (existing) {
            return { EC: -1, EM: 'Tên cửa hàng đã tồn tại.' };
        }

        await db.Store.create({
            name,
            address,
            phone,
            store_image: imagePath
        });

        return { EC: 0, EM: 'Tạo Cửa hàng thành công.' };
    } catch (error) {
        console.error('Error creating specialty:', error);
        return { EC: -1, EM: 'Lỗi server khi tạo cửa hàng.' };
    }
};
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
export default {
	getAllStore,
	getStoreById,
	createStore
};
